# Ayiti Analytics Data Processing Bootcamp
  Ayiti Analytics Data wants to expand its training centers throughout all the communes of the country. Your role as a data analyst is to help them realize this dream.

Its objective is to know which three communes of the country will be the most likely to expand its training centers.

Knowing that each cohort must have 30 students
 
* How many applications must be made to select 25% women for each on average

* What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a student to be susceptible to selection
 
* What is the average number of university students who should participate in this program
* What will be the average number of applications per week that we could have
* How many weeks should we extend the application process to select 60 students per commune?
* If we were to do all the bootcamp online, who would be the best communes and how many applications would we need to select 30 student and what percentage of students would have a laptop, an internet connection, both at the same time
* What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a women to be susceptible to selection

### NB 
Use the same framework of the BA project to complete this project

In [ ]:
Combien de candidatures faut-il faire pour sélectionner 25% de femmes pour chacune en moyenne

Quels sont les canaux de communication les plus efficaces (Alumni, Facebook, WhatsApp, Friend...) qui permettront à un étudiant d'être susceptible d'être sélectionné

Quel est le nombre moyen d'étudiants universitaires qui devraient participer à ce programme

Quel sera le nombre moyen de demandes par semaine que nous pourrions avoir
De combien de semaines doit-on allonger le processus de candidature pour sélectionner 60 étudiants par commune ?
Si nous devions faire tout le bootcamp en ligne, qui seraient les meilleures communes et combien d'applications aurions-nous besoin pour sélectionner 30 étudiants et quel pourcentage d'étudiants aurait un ordinateur portable, une connexion Internet, les deux en même temps
Quels sont les canaux de communication les plus efficaces (Alumni, Facebook, WhatsApp, Friend...) qui permettront à une femme d'être sensible à la sélection

In [31]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [32]:
pd1=pd.read_excel("commune.xlsx")
pd2=pd.read_csv("enroll.csv")
pd3=pd.read_csv("industry.csv")
pd4=pd.read_csv("ord.csv")
pd5=pd.read_csv("quest.csv")
pd6=pd.read_csv("study_domain.csv")
pd7=pd.read_csv("technology.csv")
pd8=pd.read_csv("transaction.csv")

In [ ]:
#Commune data Visulisation (5rows)

In [33]:
pd1.head()

      Commune_en     Commune_FR Commune_Id  Departement ADM1_PCODE
0       Abricots       Abricots     HT0812  Grande'Anse       HT08
1   Acul du Nord   Acul du Nord     HT0321        North       HT03
2  Anse-a-Foleur  Anse-à-Foleur     HT0922   North-West       HT09
3   Anse-a-Pitre   Anse-à-Pître     HT0234   South-East       HT02
4    Anse-a-Veau    Anse-à-Veau     HT1021       Nippes       HT10

In [50]:
#show if it have (Column NULL VALUE)
pd1.isna().sum()

Commune_en     0
Commune_FR     0
Commune_Id     0
Departement    0
ADM1_PCODE     0
dtype: int64

In [52]:
#Quantity ROWS and COLUMNS
pd1.shape

(140, 5)

In [40]:
#enroll data Visulisation Info
pd2.head()

,Unnamed: 0,created_at,expiry_date,user_id,course_name,course_id,percentage_completed,completed_at,expired,is_free_trial,completed,started_at,activated_at,updated_at,quest_id
0,0,2020-12-12T06:41:29.844Z,NaN,29816173,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-12T06:41:29.844Z,NaN
1,1,2020-12-13T14:41:17.720Z,NaN,35229766,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-13T14:41:17.720Z,NaN
2,2,2020-12-15T00:53:06.499Z,NaN,31987560,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-15T00:53:06.499Z,NaN
3,3,2020-12-18T18:38:55.683Z,NaN,35616451,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-18T18:38:55.683Z,NaN
4,4,2020-12-21T14:45:06.528Z,NaN,35390649,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-21T14:45:06.528Z,NaN

In [47]:
pd2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            148 non-null    int64
 1   created_at            148 non-null    object
 2   expiry_date           60 non-null     object
 3   user_id               148 non-null    int64
 4   course_name           148 non-null    object
 5   course_id             148 non-null    int64
 6   percentage_completed  148 non-null    float64
 7   completed_at          0 non-null      float64
 8   expired               148 non-null    bool
 9   is_free_trial         148 non-null    bool
 10  completed             148 non-null    bool
 11  started_at            135 non-null    object
 12  activated_at          77 non-null     object
 13  updated_at            148 non-null    object
 14  quest_id              102 non-null    object
dtypes: bool(3), float64(2), int64(3), object(7)
memory usage: 14.4+ KB

In [44]:
#industry data Visulisation Info
pd3.head()

,Unnamed: 0,key,values,quest_id
0,0,item1,Finance,905ddcf2-ce95-11eb-9a92-7c67a234f601
1,1,item6,Technology (Software/ Internet),905e2608-ce95-11eb-809f-7c67a234f601
2,2,item5,Education,905e2608-ce95-11eb-809f-7c67a234f601
3,3,item3,Consulting,905e2608-ce95-11eb-809f-7c67a234f601
4,4,item7,Energy,905e2608-ce95-11eb-809f-7c67a234f601

In [46]:
pd3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 807 entries, 0 to 806
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  807 non-null    int64
 1   key         807 non-null    object
 2   values      807 non-null    object
 3   quest_id    807 non-null    object
dtypes: int64(1), object(3)
memory usage: 25.3+ KB

In [48]:
#ord show
pd4.head()

,Unnamed: 0,created_at,user_id,product_name,product_id,amount_dollars,amount_cents,subscription,coupon_code,coupon_id,affiliate_referral_code,status,quest_id
0,0,2021-03-14T15:34:35.014Z,41587952,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906b3c86-ce95-11eb-b6a7-7c67a234f601
1,1,2021-03-14T04:20:23.483Z,41564742,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906636cf-ce95-11eb-8679-7c67a234f601
2,2,2021-03-12T19:29:22.832Z,41501853,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906968f5-ce95-11eb-9e1a-7c67a234f601
3,3,2021-03-12T14:23:11.154Z,40284930,Entwodiksyon Nan Syans Done,1100636,0,0,False,impact_hub_coupon,6658457.0,NaN,Complete,9060477c-ce95-11eb-ace3-7c67a234f601
4,4,2021-03-11T16:01:17.901Z,40281483,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,9064ff29-ce95-11eb-a3d3-7c67a234f601

In [49]:
#quest Data Visual.....
pd5.head()

,Unnamed: 0,gender,dob,commune,created_at,modified_at,department,education_level,university,study_domain,current_employed,formal_sector_job,have_computer_home,internet_at_home,hear_AA_1,after_AA,quest_id
0,0,male,25/08/1998,ht0111,2021-02-14T23:03:52.768400Z,2021-02-14T23:03:52.768462Z,NaN,unknown,unknown,[],unknown,unknown,unknown,unknown,unknown,unknown,905dc006-ce95-11eb-b2f9-7c67a234f601
1,1,female,29/09/1996,ht0111,2021-02-16T16:01:10.861844Z,2021-02-16T16:01:10.861899Z,ht01,Bachelors (bacc +4),other,['other'],No,unknown,Yes,Yes,Friend,Finding a job/internship,905ddcf2-ce95-11eb-9a92-7c67a234f601
2,2,male,17/05/1996,ht0111,2021-02-16T16:56:30.579504Z,2021-02-16T16:56:30.579563Z,ht01,Bachelors (bacc +4),Université d'Etat d'Haïti (UEH),[],No,unknown,Yes,Yes,Friend,Improving my data analysis skills,905e2608-ce95-11eb-809f-7c67a234f601
3,3,male,24/11/1996,ht0111,2021-02-16T16:57:55.754541Z,2021-02-16T16:57:55.754582Z,ht01,Bachelors (bacc +4),Ecole Supérieure d'Infotronique d'Haïti (ESIH),"['item1', 'item6']",No,unknown,Yes,Yes,ESIH,Improving my data analysis skills,905e4cf5-ce95-11eb-96a9-7c67a234f601
4,4,male,20/07/1997,ht0111,2021-02-16T17:05:40.907948Z,2021-02-16T17:05:40.907982Z,ht01,High School (16 years),unknown,['other'],No,unknown,Yes,Yes,WhatsApp,Mentorship,905e73fd-ce95-11eb-a7b0-7c67a234f601

In [54]:
#Quantity ROWS and COLUMNS
pd5.shape

(250, 17)

In [57]:
#Quantity ROWS and COLUMNS (Study_domain)
pd6.shape

(287, 4)

In [58]:
#Data Visual....(5rowa)
pd6.head()

   Unnamed: 0    key            values                              quest_id
0           0  other             other  905ddcf2-ce95-11eb-9a92-7c67a234f601
1           1  item1  Computer Science  905e4cf5-ce95-11eb-96a9-7c67a234f601
2           2  item6        Management  905e4cf5-ce95-11eb-96a9-7c67a234f601
3           3  other             other  905e73fd-ce95-11eb-a7b0-7c67a234f601
4           4  other             other  905e9b27-ce95-11eb-9c37-7c67a234f601

In [59]:
#Merge quest_ID
res=pd.merge(left=pd5, right=pd2[["user_id","percentage_completed",'quest_id']], how = 'left',on='quest_id')
resu=pd.merge(left=res, right=pd6, how = 'left',on='quest_id')
resul=pd.merge(left=resu, right=pd6, how = 'left',on='quest_id')
result=pd.merge(left=resul, right=pd3, how = 'left',on='quest_id')